INSERT INTO accounting.materials (title, description, cost) VALUES
  ('Дизель', 'Стандартное дизельное топливо', 1.34),
  ('Дизель Евро-5', 'Стандартное дизельное топливо', 1.44),
  ('АИ-80', 'Бензин с октановым числом 80', 0.76),
  ('АИ-92', 'Бензин с октановым числом 92', 0.97),
  ('АИ-95', 'Бензин с октановым числом 95', 1.22),
  ('АИ-98', 'Бензин с октановым числом 98', 1.37),
  ('АИ-98 Eвро-5', 'Стандартное дизельное топливо', 1.45),
  ('АИ-98 Экто', 'Стандартное дизельное топливо', 1.66),
  ('Газ Пропан', 'Стандартное дизельное топливо', 0.12);

INSERT INTO accounting.petrol_stations (title, location) VALUES
  ('Лукойл № 5', 'ул. Тростенецкая 27, Минск'),
  ('Лукойл № 4', 'ул. Брилевская 28, Минск'),
  ('Лукойл № 73', 'ул. Карла Либкнехта 128а, Минск'),
  ('Лукойл № 67', 'ул. Кижеватова 44, Минск'),
  ('Лукойл № 2', 'ул. Радиальная 7, Минск'),
  ('Лукойл № 68', 'ул. Орловская 38, Минск'),
  ('Лукойл № 65', 'ул. Кижеватова 88, Минск'),
  ('Лукойл № 69', 'ул. Южная 39, Минск'),
  ('Газпромнефть № 51', 'Партизанский просп. 103б, Минск 220000'),
  ('АЗС № 48 Газпромнефть', 'ул. Кижеватова 84, Минск 220000');

INSERT INTO accounting.materials_stations (petrol_station_id, material_id, date_of_incoming, number) VALUES
  (1, 1, '2018-05-03 10:15:00+02', 5000000.0),
  (1, 2, '2018-05-03 10:15:00+02', 5000000.0),
  (1, 3, '2018-05-03 10:15:00+02', 5000000.0),
  (1, 4, '2018-05-03 10:15:00+02', 5000000.0),
  (1, 5, '2018-05-03 10:15:00+02', 5000000.0),
  (1, 6, '2018-05-03 08:00:00+02', 5000000.0),
  (2, 2, '2018-04-29 08:00:00+02', 14300000.0),
  (2, 3, '2018-04-29 08:00:00+02', 14300000.0),
  (2, 4, '2018-04-29 08:00:00+02', 14300000.0),
  (2, 7, '2018-04-29 08:00:00+02', 15400000.0),
  (3, 2, '2018-04-27 08:27:00+02', 18300000.0),
  (3, 4, '2018-04-27 08:27:00+02', 7300000.0),
  (3, 5, '2018-04-27 08:27:00+02', 6300000.0),
  (3, 6, '2018-04-27 08:27:00+02', 18300000.0),
  (3, 8, '2018-04-27 08:27:00+02', 340000.0);
